Identifies whether the current single day sun study is set to run from sunrise to sunset.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public bool SunriseToSunset { get; set; }
  Visual Basic
Public Property SunriseToSunset As Boolean
	Get
	Set
  Visual C++
public:
property bool SunriseToSunset {
	bool get ();
	void set (bool value);
}
 See Also
  SunAndShadowSettings Class
  Autodesk.Revit.DB Namespace